artillery/test.yml
config:
  target: 'http://localhost:1337'
  processor: "./function.js"
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Register a user"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/auth/local/"
          json:
            identifier: "{{ email }}"
            password: "{{ password }}"
      - log: "Sent a request to /users with {{ email }}, {{ password }}"